
&НаСервере
Процедура СформироватьНаСервере()
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	""Долг"" КАК Показатель,
		|	Контрагенты.Ссылка КАК Контрагент,
		|	ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток КАК Сумма
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(, ) КАК ВзаиморасчетыСКонтрагентамиОстатки
		|		ПО Контрагенты.Ссылка = ВзаиморасчетыСКонтрагентамиОстатки.Контрагент
		|ГДЕ
		|	НЕ Контрагенты.ЭтоГруппа
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Продажи"",
		|	Контрагенты.Ссылка,
		|	ПродажиОбороты.СуммаОборот
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи.Обороты(, , , ) КАК ПродажиОбороты
		|		ПО Контрагенты.Ссылка = ПродажиОбороты.Контрагент
		|ГДЕ
		|	НЕ Контрагенты.ЭтоГруппа
		|ИТОГИ ПО
		|	Контрагент";
	
	РезультатЗапроса = Запрос.Выполнить();
	
 	СпособОбхода = ОбходРезультатаЗапроса.ПоГруппировкам;
      
    Дерево = РезультатЗапроса.Выгрузить(СпособОбхода);
	ЗначениеВРеквизитФормы(Дерево, "Карточка");
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры
